БухЭксп/InformationRegisters/CW_ЗначенияЛогистическихСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияЛогистическихСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогистическийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЛогистическиеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыЛогистическихСтатусов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗначенияЛогистическихСтатусовОбъектов/Ext/ManagerModule.bsl
Процедура ЗаписатьЛогистическийСтатусОбъекта(ОбъектСтатуса, ЛогистическийСтатус) Экспорт
	
	Запись = РегистрыСведений.CW_ЗначенияЛогистическихСтатусовОбъектов.СоздатьМенеджерЗаписи();
	Запись.ОбъектСтатуса = ОбъектСтатуса;
	Запись.Прочитать();
	
	Запись.ОбъектСтатуса = ОбъектСтатуса;
	Запись.ЛогистическийСтатус = ЛогистическийСтатус;
	Запись.Записать(Истина);
	
КонецПроцедуры
